libs/XML_Encryption_Attack_Library/src/test/resources/case_encKey_inside_encData.xml

<soapenv:Envelope xmlns:nds="http://nds.rub.de" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsu:Timestamp wsu:Id="Timestamp-4" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Created>2012-03-28T12:52:33.360Z</wsu:Created><wsu:Expires>2012-03-28T13:17:33.360Z</wsu:Expires></wsu:Timestamp></wsse:Security></soapenv:Header>
   <soapenv:Body Id="Body">
      <nds:pay>
         <!--Optional:-->
         <nds:name>XML-Security</nds:name>
         <!--Optional:-->
         <nds:amount>4000</nds:amount>
         <!--Optional:-->
         <nds:bankAccountNumber Id="1">
		 <xenc:EncryptedData Id="ED-2" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
		 <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/>
		 <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
		<xenc:EncryptedKey Id="EncKeyId-urn:uuid:64DB4A7E53F67EF3F112142272504712">
               <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
               <xenc:CipherData>
                  <xenc:CipherValue>Y1G4IvsVfHLHWEW89D7wC7wVYfks1/Q5JHru0NaZlDE89rRTIITZrjjS6ajcXcjNiRcQMbElYoG4tnfXOyqOYYPAWaBGXbQIQo+jFZq+hHfYt+j8YrOP8hg9uELzwtmPT7GAv1bFn+dEwEU6Ez5ZdCVH0cImWcf1fdezMkxvXcY=</xenc:CipherValue>
               </xenc:CipherData>
            </xenc:EncryptedKey>
		 </ds:KeyInfo>
		 <xenc:CipherData>
		 <xenc:CipherValue>UM2LlzEpNjpgdupv3Kd6ELb4q2HxR4ligF9WOIIbXMU=</xenc:CipherValue>
		 </xenc:CipherData>
		 </xenc:EncryptedData>
		 </nds:bankAccountNumber>
      </nds:pay>
   </soapenv:Body>
</soapenv:Envelope>
